site.org
#+STARTUP: content
#+AUTHOR: benford
#+HUGO_BASE_DIR: .
#+HUGO_AUTO_SET_LASTMOD: t
*** Discipline equals freedom
:PROPERTIES:
:EXPORT_FILE_NAME: index
:END:
I remember when I heard this phrase the first time. It was when Jocko Willink
first really burst into the light on Tim Ferriss' blog in 2015. I was starting to
realise just how much I had learned in the Royal Marines in the context of
building and leading development teams.

<!--more-->

Only a decade or so after I left the corps - I'm not the sharpest tool in the
box sometimes. :-)

I'd also drunk deeply of the typed functional programming kool aid, had used it in
anger to build a team at a start up, and had found it ridiculously effective. I
was primed to make some links between the two and the flash of inspiration came
in the form of 3 words:

#+BEGIN_QUOTE
*DISCIPLINE EQUALS FREEDOM*
#+END_QUOTE

What did I see in this seemingly simple statement?

To answer this let's first use the original quote from Aristotle, because it
more closely matches the intuition I had at the time:


#+BEGIN_QUOTE
*FROM DISCIPLINE COMES FREEDOM*
#+END_QUOTE

Some key observations drop out of this small rewording:

 * Discipline is not a static thing. It's not a binary state.
 * Freedom isn't a static thing either: It's a *vector* that has a magnitude and a
   direction.
 * Discipline doesn't equal freedom: Having more freedom is an *emergent* property
   of applying discipline.
 * Discipline, even though often spoken about as something one has, is not
   additive. It's actually about what you *take away*.

So what are we actually talking about here?

We're talking about applying *CONSTRAINTS* to *COMPLEX ADAPTIVE SYSTEMS* in
order to influence their *EMERGENT BEHAVIOURS*

So let's restate Jocko and Aristotle (alexa: what is hubris?) to:

#+BEGIN_QUOTE
*CONSTRAINTS* shape *BEHAVIOUR*
#+END_QUOTE

This is an incredibly profound principle, with implications for everything that
happens in any kind of human endeavour. For example:

Culture is an emergent property of the constraints applied to a group of
people. That means you don't get to create culture. The only thing you get to do
is shape are the constraints that form the system in which that culture evolves.

Quality is an emergent property of the constraints applied to a software
project. That means you don't get to create quality. The only thing you get to
shape are the constraints that inform how the software develops.

The kind of person your child develops into is an emergent property of the
constraints you apply as a parent. That means you don't get to create carbon
copies of yourself. How kids develop is an emergent property of the constraints
you (try to) apply as a parent.

**** Summary

We generally think of constraints with a negative connotation. Just look at some
of the synonyms: restriction, limitation, control, obstruction, impediment
*handicap*

These are all fair enough when you're in any kind of linear system. In a linear
world discipline doesn't equal freedom because you only would only see what you
can't do. But we do not live in a linear world. We live in a complex, networked
adaptive world and instead of shunning constraints, we should view them as
essential structure that we need to shape our path. How would you ever be able
to take on a novel challenge without understanding the constraints of the
project, if anything is theoretically possible, no tangible progress is actually
possible.

So let's restate these ideas one last time:

#+begin_quote
*STRUCTURE* enables *PROGRESS*
#+end_quote

Pay attention to the structures you put in place in your life and work. Progress
is a second order effect of the leverage you create.

